MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S7I8/mcu.h
#define GFXMMU_VIRTUAL_BUFFER0_BASE     0x25000000UL  /*!< GFXMMU virtual buffer 0 base address */
#define GFXMMU_VIRTUAL_BUFFER1_BASE     0x25400000UL  /*!< GFXMMU virtual buffer 1 base address */
#define GFXMMU_VIRTUAL_BUFFER2_BASE     0x25800000UL  /*!< GFXMMU virtual buffer 2 base address */
#define GFXMMU_VIRTUAL_BUFFER3_BASE     0x25C00000UL  /*!< GFXMMU virtual buffer 3 base address */

#define SRAM1_AHB_BASE                  0x30000000UL  /*!< SRAM1 base address */
#define SRAM2_AHB_BASE                  0x30004000UL  /*!< SRAM2 base address */
#define BKPSRAM_BASE                    0x38800000UL  /*!< Backup SRAM */

#define PERIPH_BASE                     0x40000000UL  /*!< AHB and APB Peripherals base address */
#define XSPI2_BASE                      0x70000000UL  /*!< XSPI2 base address */
#define XSPI1_BASE                      0x90000000UL  /*!< XSPI1 base address */

/*!< Internal memory size */
#define ITCM_SIZE                       0x00010000UL  /*!< 64 KB default, can be increased up to 192 KB */
#define DTCM_SIZE                       0x00010000UL  /*!< 64 KB default, can be increased up to 192 KB */
#define FLASH_SIZE                      0x00010000UL  /*!< 64 KB */
#define SRAM1_AXI_SIZE                  0x00020000UL  /*!< 128 KB default, can be decreased down to 0 KB to increase ITCM */
#define SRAM2_AXI_SIZE                  0x00020000UL  /*!< 128 KB */
#define SRAM3_AXI_SIZE                  0x00020000UL  /*!< 128 KB default, can be decreased down to 0 KB to increase DTCM */
#define SRAM4_AXI_SIZE                  0x00012000UL  /*!< 72 KB default, can be decreased to 0 KB when RAM ECC is disable */
#define SRAM_AHB_SIZE                   0x00004000UL  /*!< Both AHB SRAMs are 16 KB */
#define BKPSRAM_SIZE                    0x00001000UL  /*!< 4 KB */

/*!< OTP Area size */
#define OTP_SIZE               0x400U /* 1 KB */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE                 PERIPH_BASE
#define AHB1PERIPH_BASE                 (PERIPH_BASE + 0x00020000UL)
#define APB2PERIPH_BASE                 (PERIPH_BASE + 0x02000000UL)
#define AHB2PERIPH_BASE                 (PERIPH_BASE + 0x08000000UL)
#define AHB3PERIPH_BASE                 (PERIPH_BASE + 0x08020000UL)
#define APB5PERIPH_BASE                 (PERIPH_BASE + 0x10000000UL)
#define AHB5PERIPH_BASE                 (PERIPH_BASE + 0x12000000UL)
#define APB4PERIPH_BASE                 (PERIPH_BASE + 0x18000000UL)
#define AHB4PERIPH_BASE                 (PERIPH_BASE + 0x18020000UL)

/*!< APB1 peripherals */
#define TIM2_BASE                       (APB1PERIPH_BASE + 0x0000UL)
#define TIM3_BASE                       (APB1PERIPH_BASE + 0x0400UL)
#define TIM4_BASE                       (APB1PERIPH_BASE + 0x0800UL)
#define TIM5_BASE                       (APB1PERIPH_BASE + 0x0C00UL)
#define TIM6_BASE                       (APB1PERIPH_BASE + 0x1000UL)
#define TIM7_BASE                       (APB1PERIPH_BASE + 0x1400UL)
#define TIM12_BASE                      (APB1PERIPH_BASE + 0x1800UL)
#define TIM13_BASE                      (APB1PERIPH_BASE + 0x1C00UL)
#define TIM14_BASE                      (APB1PERIPH_BASE + 0x2000UL)
#define LPTIM1_BASE                     (APB1PERIPH_BASE + 0x2400UL)
#define WWDG_BASE                       (APB1PERIPH_BASE + 0x2C00UL)
#define SPI2_BASE                       (APB1PERIPH_BASE + 0x3800UL)
#define SPI3_BASE                       (APB1PERIPH_BASE + 0x3C00UL)
#define SPDIFRX_BASE                    (APB1PERIPH_BASE + 0x4000UL)
#define USART2_BASE                     (APB1PERIPH_BASE + 0x4400UL)
#define USART3_BASE                     (APB1PERIPH_BASE + 0x4800UL)
#define UART4_BASE                      (APB1PERIPH_BASE + 0x4C00UL)
#define UART5_BASE                      (APB1PERIPH_BASE + 0x5000UL)
#define I2C1_BASE                       (APB1PERIPH_BASE + 0x5400UL)
#define I3C1_BASE                       (APB1PERIPH_BASE + 0x5400UL)
#define I2C2_BASE                       (APB1PERIPH_BASE + 0x5800UL)
#define I2C3_BASE                       (APB1PERIPH_BASE + 0x5C00UL)
#define CEC_BASE                        (APB1PERIPH_BASE + 0x6C00UL)
#define UART7_BASE                      (APB1PERIPH_BASE + 0x7800UL)
#define UART8_BASE                      (APB1PERIPH_BASE + 0x7C00UL)
#define CRS_BASE                        (APB1PERIPH_BASE + 0x8400UL)
#define MDIOS_BASE                      (APB1PERIPH_BASE + 0x9400UL)
#define FDCAN1_BASE                     (APB1PERIPH_BASE + 0xA000UL)
#define FDCAN_CONFIG_BASE               (APB1PERIPH_BASE + 0xA100UL)  /*!< FDCAN configuration registers base address */
#define FDCAN2_BASE                     (APB1PERIPH_BASE + 0xA400UL)
#define SRAMCAN_BASE                    (APB1PERIPH_BASE + 0xAC00UL)
#define UCPD1_BASE                      (APB1PERIPH_BASE + 0xEC00UL)

/*!< APB2 peripherals */
#define TIM1_BASE                       (APB2PERIPH_BASE + 0x0000UL)
#define USART1_BASE                     (APB2PERIPH_BASE + 0x1000UL)
#define SPI1_BASE                       (APB2PERIPH_BASE + 0x3000UL)
#define SPI4_BASE                       (APB2PERIPH_BASE + 0x3400UL)
#define TIM15_BASE                      (APB2PERIPH_BASE + 0x4000UL)
#define TIM16_BASE                      (APB2PERIPH_BASE + 0x4400UL)
#define TIM17_BASE                      (APB2PERIPH_BASE + 0x4800UL)
#define TIM9_BASE                       (APB2PERIPH_BASE + 0x4C00UL)
#define SPI5_BASE                       (APB2PERIPH_BASE + 0x5000UL)
#define SAI1_BASE                       (APB2PERIPH_BASE + 0x5800UL)
#define SAI1_Block_A_BASE               (SAI1_BASE + 0x0004UL)
#define SAI1_Block_B_BASE               (SAI1_BASE + 0x0024UL)
#define SAI2_BASE                       (APB2PERIPH_BASE + 0x5C00UL)
#define SAI2_Block_A_BASE               (SAI2_BASE + 0x0004UL)
#define SAI2_Block_B_BASE               (SAI2_BASE + 0x0024UL)

/*!< AHB1 peripherals */
#define GPDMA1_BASE                     (AHB1PERIPH_BASE + 0x1000UL)
#define GPDMA1_Channel0_BASE            (GPDMA1_BASE + 0x0050UL)
#define GPDMA1_Channel1_BASE            (GPDMA1_BASE + 0x00D0UL)
#define GPDMA1_Channel2_BASE            (GPDMA1_BASE + 0x0150UL)
#define GPDMA1_Channel3_BASE            (GPDMA1_BASE + 0x01D0UL)
#define GPDMA1_Channel4_BASE            (GPDMA1_BASE + 0x0250UL)
#define GPDMA1_Channel5_BASE            (GPDMA1_BASE + 0x02D0UL)
#define GPDMA1_Channel6_BASE            (GPDMA1_BASE + 0x0350UL)
#define GPDMA1_Channel7_BASE            (GPDMA1_BASE + 0x03D0UL)
#define GPDMA1_Channel8_BASE            (GPDMA1_BASE + 0x0450UL)
#define GPDMA1_Channel9_BASE            (GPDMA1_BASE + 0x04D0UL)
#define GPDMA1_Channel10_BASE           (GPDMA1_BASE + 0x0550UL)
#define GPDMA1_Channel11_BASE           (GPDMA1_BASE + 0x05D0UL)
#define GPDMA1_Channel12_BASE           (GPDMA1_BASE + 0x0650UL)
#define GPDMA1_Channel13_BASE           (GPDMA1_BASE + 0x06D0UL)
#define GPDMA1_Channel14_BASE           (GPDMA1_BASE + 0x0750UL)
#define GPDMA1_Channel15_BASE           (GPDMA1_BASE + 0x07D0UL)
#define ADC1_BASE                       (AHB1PERIPH_BASE + 0x2000UL)
#define ADC2_BASE                       (AHB1PERIPH_BASE + 0x2100UL)
#define ADC12_COMMON_BASE               (AHB1PERIPH_BASE + 0x2300UL)
#define ETH_BASE                        (AHB1PERIPH_BASE + 0x8000UL)
#define ETH_MAC_BASE                    (ETH_BASE)
#define ADF1_BASE                       (AHB1PERIPH_BASE + 0xF000UL)
#define ADF1_Filter0_BASE               (ADF1_BASE + 0x0080UL)
#define USB_OTG_HS_PERIPH_BASE          (AHB1PERIPH_BASE + 0x20000UL)
#define USB_OTG_FS_PERIPH_BASE          (AHB1PERIPH_BASE + 0x60000UL)

/*!< AHB2 peripherals */
#define PSSI_BASE                       (AHB2PERIPH_BASE + 0x0400UL)
#define SDMMC2_BASE                     (AHB2PERIPH_BASE + 0x2400UL)
#define DLYB_SDMMC2_BASE                (AHB2PERIPH_BASE + 0x2800UL)
#define CORDIC_BASE                     (AHB2PERIPH_BASE + 0x4400UL)

/*!< AHB3 peripherals */
#define RNG_BASE                        AHB3PERIPH_BASE
#define HASH_BASE                       (AHB3PERIPH_BASE + 0x0400UL)
#define HASH_DIGEST_BASE                (AHB3PERIPH_BASE + 0x0710UL)
#define CRYP_BASE                       (AHB3PERIPH_BASE + 0x0800UL)
#define SAES_BASE                       (AHB3PERIPH_BASE + 0x1000UL)
#define PKA_BASE                        (AHB3PERIPH_BASE + 0x2000UL)

/*!< APB5 peripherals */
#define LTDC_BASE                       (APB5PERIPH_BASE + 0x1000UL)
#define LTDC_Layer1_BASE                (LTDC_BASE + 0x0084UL)
#define LTDC_Layer2_BASE                (LTDC_BASE + 0x0104UL)
#define DCMIPP_BASE                     (APB5PERIPH_BASE + 0x2000UL)
#define GFXTIM_BASE                     (APB5PERIPH_BASE + 0x4000UL)

/*!< AHB5 peripherals */
#define HPDMA1_BASE                     AHB5PERIPH_BASE
#define HPDMA1_Channel0_BASE            (HPDMA1_BASE + 0x0050UL)
#define HPDMA1_Channel1_BASE            (HPDMA1_BASE + 0x00D0UL)
#define HPDMA1_Channel2_BASE            (HPDMA1_BASE + 0x0150UL)
#define HPDMA1_Channel3_BASE            (HPDMA1_BASE + 0x01D0UL)
#define HPDMA1_Channel4_BASE            (HPDMA1_BASE + 0x0250UL)
#define HPDMA1_Channel5_BASE            (HPDMA1_BASE + 0x02D0UL)
#define HPDMA1_Channel6_BASE            (HPDMA1_BASE + 0x0350UL)
#define HPDMA1_Channel7_BASE            (HPDMA1_BASE + 0x03D0UL)
#define HPDMA1_Channel8_BASE            (HPDMA1_BASE + 0x0450UL)
#define HPDMA1_Channel9_BASE            (HPDMA1_BASE + 0x04D0UL)
#define HPDMA1_Channel10_BASE           (HPDMA1_BASE + 0x0550UL)
#define HPDMA1_Channel11_BASE           (HPDMA1_BASE + 0x05D0UL)
#define HPDMA1_Channel12_BASE           (HPDMA1_BASE + 0x0650UL)
#define HPDMA1_Channel13_BASE           (HPDMA1_BASE + 0x06D0UL)
#define HPDMA1_Channel14_BASE           (HPDMA1_BASE + 0x0750UL)
#define HPDMA1_Channel15_BASE           (HPDMA1_BASE + 0x07D0UL)
#define DMA2D_BASE                      (AHB5PERIPH_BASE + 0x1000UL)
#define FLASH_R_BASE                    (AHB5PERIPH_BASE + 0x2000UL)
#define JPEG_BASE                       (AHB5PERIPH_BASE + 0x3000UL)
#define FMC_R_BASE                      (AHB5PERIPH_BASE + 0x4000UL)
#define FMC_Bank1_R_BASE                (FMC_R_BASE + 0x0000UL)
#define FMC_Bank1E_R_BASE               (FMC_R_BASE + 0x0104UL)
#define FMC_Bank3_R_BASE                (FMC_R_BASE + 0x0080UL)
#define FMC_Bank5_6_R_BASE              (FMC_R_BASE + 0x0140UL)
#define XSPI1_R_BASE                    (AHB5PERIPH_BASE + 0x5000UL)
#define SDMMC1_BASE                     (AHB5PERIPH_BASE + 0x7000UL)
#define DLYB_SDMMC1_BASE                (AHB5PERIPH_BASE + 0x8000UL)
#define RAMECC1_BASE                    (AHB5PERIPH_BASE + 0x9000UL)
#define RAMECC1_Monitor0_BASE           (RAMECC1_BASE + 0x20UL)
#define RAMECC1_Monitor1_BASE           (RAMECC1_BASE + 0x40UL)
#define RAMECC1_Monitor2_BASE           (RAMECC1_BASE + 0x60UL)
#define RAMECC1_Monitor3_BASE           (RAMECC1_BASE + 0x80UL)
#define RAMECC1_Monitor4_BASE           (RAMECC1_BASE + 0xA0UL)
#define XSPI2_R_BASE                    (AHB5PERIPH_BASE + 0xA000UL)
#define XSPIM_BASE                      (AHB5PERIPH_BASE + 0xB400UL)
#define MCE1_BASE                       (AHB5PERIPH_BASE + 0xB800UL)
#define MCE1_REGION1_BASE               (MCE1_BASE + 0x040UL)
#define MCE1_REGION2_BASE               (MCE1_BASE + 0x050UL)
#define MCE1_REGION3_BASE               (MCE1_BASE + 0x060UL)
#define MCE1_REGION4_BASE               (MCE1_BASE + 0x070UL)
#define MCE1_CONTEXT1_BASE              (MCE1_BASE + 0x240UL)
#define MCE1_CONTEXT2_BASE              (MCE1_BASE + 0x270UL)
#define MCE2_BASE                       (AHB5PERIPH_BASE + 0xBC00UL)
#define MCE2_REGION1_BASE               (MCE2_BASE + 0x040UL)
#define MCE2_REGION2_BASE               (MCE2_BASE + 0x050UL)
#define MCE2_REGION3_BASE               (MCE2_BASE + 0x060UL)
#define MCE2_REGION4_BASE               (MCE2_BASE + 0x070UL)
#define MCE3_BASE                       (AHB5PERIPH_BASE + 0xC000UL)
#define MCE3_REGION1_BASE               (MCE3_BASE + 0x040UL)
#define MCE3_REGION2_BASE               (MCE3_BASE + 0x050UL)
#define MCE3_REGION3_BASE               (MCE3_BASE + 0x060UL)
#define MCE3_REGION4_BASE               (MCE3_BASE + 0x070UL)
#define GFXMMU_BASE                     (AHB5PERIPH_BASE + 0x010000UL)
#define GPU2D_BASE                      (AHB5PERIPH_BASE + 0x014000UL)
#define ICACHE_BASE                     (AHB5PERIPH_BASE + 0x015000UL)

/*!< APB4 peripherals */
#define EXTI_BASE                       APB4PERIPH_BASE
#define SBS_BASE                        (APB4PERIPH_BASE + 0x0400UL)
#define LPUART1_BASE                    (APB4PERIPH_BASE + 0x0C00UL)
#define SPI6_BASE                       (APB4PERIPH_BASE + 0x1400UL)
#define LPTIM2_BASE                     (APB4PERIPH_BASE + 0x2400UL)
#define LPTIM3_BASE                     (APB4PERIPH_BASE + 0x2800UL)
#define LPTIM4_BASE                     (APB4PERIPH_BASE + 0x2C00UL)
#define LPTIM5_BASE                     (APB4PERIPH_BASE + 0x3000UL)
#define VREFBUF_BASE                    (APB4PERIPH_BASE + 0x3C00UL)
#define RTC_BASE                        (APB4PERIPH_BASE + 0x4000UL)
#define TAMP_BASE                       (APB4PERIPH_BASE + 0x4400UL)
#define IWDG_BASE                       (APB4PERIPH_BASE + 0x4800UL)
#define DTS_BASE                        (APB4PERIPH_BASE + 0x6800UL)

/*!< AHB4 peripherals */
#define GPIOA_BASE                      AHB4PERIPH_BASE
#define GPIOB_BASE                      (AHB4PERIPH_BASE + 0x0400UL)
#define GPIOC_BASE                      (AHB4PERIPH_BASE + 0x0800UL)
#define GPIOD_BASE                      (AHB4PERIPH_BASE + 0x0C00UL)
#define GPIOE_BASE                      (AHB4PERIPH_BASE + 0x1000UL)
#define GPIOF_BASE                      (AHB4PERIPH_BASE + 0x1400UL)
#define GPIOG_BASE                      (AHB4PERIPH_BASE + 0x1800UL)
#define GPIOH_BASE                      (AHB4PERIPH_BASE + 0x1C00UL)
#define GPIOM_BASE                      (AHB4PERIPH_BASE + 0x3000UL)
#define GPION_BASE                      (AHB4PERIPH_BASE + 0x3400UL)
#define GPIOO_BASE                      (AHB4PERIPH_BASE + 0x3800UL)
#define GPIOP_BASE                      (AHB4PERIPH_BASE + 0x3C00UL)
#define RCC_BASE                        (AHB4PERIPH_BASE + 0x4400UL)
#define PWR_BASE                        (AHB4PERIPH_BASE + 0x4800UL)
#define CRC_BASE                        (AHB4PERIPH_BASE + 0x4C00UL)
#define RAMECC2_BASE                    (AHB4PERIPH_BASE + 0x7000UL)
#define RAMECC2_Monitor1_BASE           (RAMECC2_BASE + 0x40UL)

/*!< Debug MCU registers base address */
#define DBGMCU_BASE                     (0x5C001000UL)

/*!< AXIM registers base address */
#define AXIM_BASE                        (0xBFF00000UL)
#define AXIM_ASIB1_BASE                  (AXIM_BASE + 0x42000UL)
#define AXIM_ASIB2_BASE                  (AXIM_BASE + 0x43000UL)
#define AXIM_ASIB3_BASE                  (AXIM_BASE + 0x44000UL)
#define AXIM_ASIB4_BASE                  (AXIM_BASE + 0x45000UL)
#define AXIM_ASIB5_BASE                  (AXIM_BASE + 0x46000UL)
#define AXIM_ASIB6_BASE                  (AXIM_BASE + 0x47000UL)
#define AXIM_ASIB7_BASE                  (AXIM_BASE + 0x48000UL)
#define AXIM_ASIB8_BASE                  (AXIM_BASE + 0x49000UL)
#define AXIM_ASIB9_BASE                  (AXIM_BASE + 0x4A000UL)
#define AXIM_ASIB10_BASE                 (AXIM_BASE + 0x4B000UL)
#define AXIM_ASIB11_BASE                 (AXIM_BASE + 0x4C000UL)
#define AXIM_AMIB1_BASE                  (AXIM_BASE + 0x02000UL)
#define AXIM_AMIB2_BASE                  (AXIM_BASE + 0x03000UL)
#define AXIM_AMIB3_BASE                  (AXIM_BASE + 0x04000UL)
#define AXIM_AMIB4_BASE                  (AXIM_BASE + 0x05000UL)
#define AXIM_AMIB5_BASE                  (AXIM_BASE + 0x06000UL)
#define AXIM_AMIB6_BASE                  (AXIM_BASE + 0x07000UL)
#define AXIM_AMIB7_BASE                  (AXIM_BASE + 0x08000UL)
#define AXIM_AMIB8_BASE                  (AXIM_BASE + 0x09000UL)
#define AXIM_AMIB9_BASE                  (AXIM_BASE + 0x0A000UL)
#define AXIM_AMIB10_BASE                 (AXIM_BASE + 0x0B000UL)

