MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S7I8/mcu.h
/***************  Bits definition for FLASH_CRCDATAR register  ****************/
#define FLASH_CRCDATAR_CRC_DATA_Pos          (0U)
#define FLASH_CRCDATAR_CRC_DATA_Msk          (0xFFFFFFFFUL << FLASH_CRCDATAR_CRC_DATA_Pos)       /*!< 0xFFFFFFFF */
#define FLASH_CRCDATAR_CRC_DATA              FLASH_CRCDATAR_CRC_DATA_Msk                         /*!< CRC result */

/**************  Bits definition for FLASH_ECCSFADDR register  ****************/
#define FLASH_ECCSFADDR_SEC_FADD_Pos         (0U)
#define FLASH_ECCSFADDR_SEC_FADD_Msk         (0xFFFFFFFFUL << FLASH_ECCSFADDR_SEC_FADD_Pos)      /*!< 0xFFFFFFFF */
#define FLASH_ECCSFADDR_SEC_FADD             FLASH_ECCSFADDR_SEC_FADD_Msk                        /*!< ECC single error correction fail address */

/**************  Bits definition for FLASH_ECCDFADDR register  ****************/
#define FLASH_ECCDFADDR_DED_FADD_Pos         (0U)
#define FLASH_ECCDFADDR_DED_FADD_Msk         (0xFFFFFFFFUL << FLASH_ECCDFADDR_DED_FADD_Pos)      /*!< 0xFFFFFFFF */
#define FLASH_ECCDFADDR_DED_FADD             FLASH_ECCDFADDR_DED_FADD_Msk                        /*!< ECC double error detection fail address */

/****************  Bits definition for FLASH_OPTKEYR register  ****************/
#define FLASH_OPTKEYR_OCUKEY_Pos             (0U)
#define FLASH_OPTKEYR_OCUKEY_Msk             (0xFFFFFFFFUL << FLASH_OPTKEYR_OCUKEY_Pos)          /*!< 0xFFFFFFFF */
#define FLASH_OPTKEYR_OCUKEY                 FLASH_OPTKEYR_OCUKEY_Msk                            /*!< Options configuration unlock key */

/*****************  Bits definition for FLASH_OPTCR register  *****************/
#define FLASH_OPTCR_OPTLOCK_Pos              (0U)
#define FLASH_OPTCR_OPTLOCK_Msk              (0x1UL << FLASH_OPTCR_OPTLOCK_Pos)                  /*!< 0x00000001 */
#define FLASH_OPTCR_OPTLOCK                  FLASH_OPTCR_OPTLOCK_Msk                             /*!< Options lock */
#define FLASH_OPTCR_PG_OPT_Pos               (1U)
#define FLASH_OPTCR_PG_OPT_Msk               (0x1UL << FLASH_OPTCR_PG_OPT_Pos)                   /*!< 0x00000002 */
#define FLASH_OPTCR_PG_OPT                   FLASH_OPTCR_PG_OPT_Msk                              /*!< Program options */
#define FLASH_OPTCR_KVEIE_Pos                (27U)
#define FLASH_OPTCR_KVEIE_Msk                (0x1UL << FLASH_OPTCR_KVEIE_Pos)                    /*!< 0x08000000 */
#define FLASH_OPTCR_KVEIE                    FLASH_OPTCR_KVEIE_Msk                               /*!< Key valid error interrupt enable bit */
#define FLASH_OPTCR_KTEIE_Pos                (28U)
#define FLASH_OPTCR_KTEIE_Msk                (0x1UL << FLASH_OPTCR_KTEIE_Pos)                    /*!< 0x10000000 */
#define FLASH_OPTCR_KTEIE                    FLASH_OPTCR_KTEIE_Msk                               /*!< Key transfer error interrupt enable bit */
#define FLASH_OPTCR_OPTERRIE_Pos             (30U)
#define FLASH_OPTCR_OPTERRIE_Msk             (0x1UL << FLASH_OPTCR_OPTERRIE_Pos)                 /*!< 0x40000000 */
#define FLASH_OPTCR_OPTERRIE                 FLASH_OPTCR_OPTERRIE_Msk                            /*!< Options byte change error interrupt enable bit */

/****************  Bits definition for FLASH_OPTISR register  *****************/
#define FLASH_OPTISR_KVEF_Pos                (27U)
#define FLASH_OPTISR_KVEF_Msk                (0x1UL << FLASH_OPTISR_KVEF_Pos)                    /*!< 0x08000000 */
#define FLASH_OPTISR_KVEF                    FLASH_OPTISR_KVEF_Msk                               /*!< Key valid error flag */
#define FLASH_OPTISR_KTEF_Pos                (28U)
#define FLASH_OPTISR_KTEF_Msk                (0x1UL << FLASH_OPTISR_KTEF_Pos)                    /*!< 0x10000000 */
#define FLASH_OPTISR_KTEF                    FLASH_OPTISR_KTEF_Msk                               /*!< Key transfer error flag */
#define FLASH_OPTISR_OPTERRF_Pos             (30U)
#define FLASH_OPTISR_OPTERRF_Msk             (0x1UL << FLASH_OPTISR_OPTERRF_Pos)                 /*!< 0x40000000 */
#define FLASH_OPTISR_OPTERRF                 FLASH_OPTISR_OPTERRF_Msk                            /*!< Options byte change error flag */

/****************  Bits definition for FLASH_OPTICR register  *****************/
#define FLASH_OPTICR_KVEF_Pos                (27U)
#define FLASH_OPTICR_KVEF_Msk                (0x1UL << FLASH_OPTICR_KVEF_Pos)                    /*!< 0x08000000 */
#define FLASH_OPTICR_KVEF                    FLASH_OPTICR_KVEF_Msk                               /*!< Key valid error flag clear */
#define FLASH_OPTICR_KTEF_Pos                (28U)
#define FLASH_OPTICR_KTEF_Msk                (0x1UL << FLASH_OPTICR_KTEF_Pos)                    /*!< 0x10000000 */
#define FLASH_OPTICR_KTEF                    FLASH_OPTICR_KTEF_Msk                               /*!< Key transfer error flag clear */
#define FLASH_OPTICR_OPTERRF_Pos             (30U)
#define FLASH_OPTICR_OPTERRF_Msk             (0x1UL << FLASH_OPTICR_OPTERRF_Pos)                 /*!< 0x40000000 */
#define FLASH_OPTICR_OPTERRF                 FLASH_OPTICR_OPTERRF_Msk                            /*!< Options byte change error flag clear */

/****************  Bits definition for FLASH_OBKCR register  *****************/
#define FLASH_OBKCR_OBKINDEX_Pos             (0U)
#define FLASH_OBKCR_OBKINDEX_Msk             (0x1FUL << FLASH_OBKCR_OBKINDEX_Pos)               /*!< 0x0000001F */
#define FLASH_OBKCR_OBKINDEX                 FLASH_OBKCR_OBKINDEX_Msk                           /*!< Option byte key index */
#define FLASH_OBKCR_OBKINDEX_0               (0x1UL << FLASH_OBKCR_OBKINDEX_Pos)                /*!< 0x00000001 */
#define FLASH_OBKCR_OBKINDEX_1               (0x2UL << FLASH_OBKCR_OBKINDEX_Pos)                /*!< 0x00000002 */
#define FLASH_OBKCR_OBKINDEX_2               (0x4UL << FLASH_OBKCR_OBKINDEX_Pos)                /*!< 0x00000004 */
#define FLASH_OBKCR_OBKINDEX_3               (0x8UL << FLASH_OBKCR_OBKINDEX_Pos)                /*!< 0x00000008 */
#define FLASH_OBKCR_OBKINDEX_4               (0x10UL << FLASH_OBKCR_OBKINDEX_Pos)               /*!< 0x00000010 */
#define FLASH_OBKCR_NEXTKL_Pos               (8U)
#define FLASH_OBKCR_NEXTKL_Msk               (0x3UL << FLASH_OBKCR_NEXTKL_Pos)                  /*!< 0x00000300 */
#define FLASH_OBKCR_NEXTKL                   FLASH_OBKCR_NEXTKL_Msk                             /*!< Next key level */
#define FLASH_OBKCR_NEXTKL_0                 (0x1UL << FLASH_OBKCR_NEXTKL_Pos)                  /*!< 0x00000100 */
#define FLASH_OBKCR_NEXTKL_1                 (0x2UL << FLASH_OBKCR_NEXTKL_Pos)                  /*!< 0x00000200 */
#define FLASH_OBKCR_OBKSIZE_Pos              (10U)
#define FLASH_OBKCR_OBKSIZE_Msk              (0x3UL << FLASH_OBKCR_OBKSIZE_Pos)                 /*!< 0x00000C00 */
#define FLASH_OBKCR_OBKSIZE                  FLASH_OBKCR_OBKSIZE_Msk                            /*!< Option byte key size */
#define FLASH_OBKCR_OBKSIZE_0                (0x1UL << FLASH_OBKCR_OBKSIZE_Pos)                 /*!< 0x00000400 */
#define FLASH_OBKCR_OBKSIZE_1                (0x2UL << FLASH_OBKCR_OBKSIZE_Pos)                 /*!< 0x00000800 */
#define FLASH_OBKCR_KEYPROG_Pos              (14U)
#define FLASH_OBKCR_KEYPROG_Msk              (0x1UL << FLASH_OBKCR_KEYPROG_Pos)                 /*!< 0x00004000 */
#define FLASH_OBKCR_KEYPROG                  FLASH_OBKCR_KEYPROG_Msk                            /*!< Key program */
#define FLASH_OBKCR_KEYSTART_Pos             (15U)
#define FLASH_OBKCR_KEYSTART_Msk             (0x1UL << FLASH_OBKCR_KEYSTART_Pos)                /*!< 0x00008000 */
#define FLASH_OBKCR_KEYSTART                 FLASH_OBKCR_KEYSTART_Msk                           /*!< Key option start */

/****************  Bits definition for FLASH_OBKDRx register  *****************/
#define FLASH_OBKDRx_OBKDATA_Pos             (0U)
#define FLASH_OBKDRx_OBKDATA_Msk             (0xFFFFFFFFUL << FLASH_OBKDRx_OBKDATA_Pos)           /*!< 0xFFFFFFFF */
#define FLASH_OBKDRx_OBKDATA                 FLASH_OBKDRx_OBKDATA_Msk                             /*!< Option byte key data */

/*****************  Bits definition for FLASH_NVSR register  ******************/
#define FLASH_NVSR_NVSTATE_Pos               (0U)
#define FLASH_NVSR_NVSTATE_Msk               (0xFFUL << FLASH_NVSR_NVSTATE_Pos)                  /*!< 0x000000FF */
#define FLASH_NVSR_NVSTATE                   FLASH_NVSR_NVSTATE_Msk                              /*!< Non-volatile state */
#define FLASH_NVSR_NVSTATE_0                 (0x1UL << FLASH_NVSR_NVSTATE_Pos)                   /*!< 0x00000001 */
#define FLASH_NVSR_NVSTATE_1                 (0x2UL << FLASH_NVSR_NVSTATE_Pos)                   /*!< 0x00000002 */
#define FLASH_NVSR_NVSTATE_2                 (0x4UL << FLASH_NVSR_NVSTATE_Pos)                   /*!< 0x00000004 */
#define FLASH_NVSR_NVSTATE_3                 (0x8UL << FLASH_NVSR_NVSTATE_Pos)                   /*!< 0x00000008 */
#define FLASH_NVSR_NVSTATE_4                 (0x10UL << FLASH_NVSR_NVSTATE_Pos)                  /*!< 0x00000010 */
#define FLASH_NVSR_NVSTATE_5                 (0x20UL << FLASH_NVSR_NVSTATE_Pos)                  /*!< 0x00000020 */
#define FLASH_NVSR_NVSTATE_6                 (0x40UL << FLASH_NVSR_NVSTATE_Pos)                  /*!< 0x00000040 */
#define FLASH_NVSR_NVSTATE_7                 (0x80UL << FLASH_NVSR_NVSTATE_Pos)                  /*!< 0x00000080 */

/****************  Bits definition for FLASH_NVSRP register  ******************/
#define FLASH_NVSRP_NVSTATE_Pos              (0U)
#define FLASH_NVSRP_NVSTATE_Msk              (0xFFUL << FLASH_NVSRP_NVSTATE_Pos)                 /*!< 0x000000FF */
#define FLASH_NVSRP_NVSTATE                  FLASH_NVSRP_NVSTATE_Msk                             /*!< Non-volatile state */
#define FLASH_NVSRP_NVSTATE_0                (0x1UL << FLASH_NVSRP_NVSTATE_Pos)                  /*!< 0x00000001 */
#define FLASH_NVSRP_NVSTATE_1                (0x2UL << FLASH_NVSRP_NVSTATE_Pos)                  /*!< 0x00000002 */
#define FLASH_NVSRP_NVSTATE_2                (0x4UL << FLASH_NVSRP_NVSTATE_Pos)                  /*!< 0x00000004 */
#define FLASH_NVSRP_NVSTATE_3                (0x8UL << FLASH_NVSRP_NVSTATE_Pos)                  /*!< 0x00000008 */
#define FLASH_NVSRP_NVSTATE_4                (0x10UL << FLASH_NVSRP_NVSTATE_Pos)                 /*!< 0x00000010 */
#define FLASH_NVSRP_NVSTATE_5                (0x20UL << FLASH_NVSRP_NVSTATE_Pos)                 /*!< 0x00000020 */
#define FLASH_NVSRP_NVSTATE_6                (0x40UL << FLASH_NVSRP_NVSTATE_Pos)                 /*!< 0x00000040 */
#define FLASH_NVSRP_NVSTATE_7                (0x80UL << FLASH_NVSRP_NVSTATE_Pos)                 /*!< 0x00000080 */

/****************  Bits definition for FLASH_ROTSR register  ******************/
#define FLASH_ROTSR_OEM_PROVD_Pos            (0U)
#define FLASH_ROTSR_OEM_PROVD_Msk            (0xFFUL << FLASH_ROTSR_OEM_PROVD_Pos)               /*!< 0x000000FF */
#define FLASH_ROTSR_OEM_PROVD                FLASH_ROTSR_OEM_PROVD_Msk                           /*!< OEM provisioned state */
#define FLASH_ROTSR_OEM_PROVD_0              (0x1UL << FLASH_ROTSR_OEM_PROVD_Pos)                /*!< 0x00000001 */
#define FLASH_ROTSR_OEM_PROVD_1              (0x2UL << FLASH_ROTSR_OEM_PROVD_Pos)                /*!< 0x00000002 */
#define FLASH_ROTSR_OEM_PROVD_2              (0x4UL << FLASH_ROTSR_OEM_PROVD_Pos)                /*!< 0x00000004 */
#define FLASH_ROTSR_OEM_PROVD_3              (0x8UL << FLASH_ROTSR_OEM_PROVD_Pos)                /*!< 0x00000008 */
#define FLASH_ROTSR_OEM_PROVD_4              (0x10UL << FLASH_ROTSR_OEM_PROVD_Pos)               /*!< 0x00000010 */
#define FLASH_ROTSR_OEM_PROVD_5              (0x20UL << FLASH_ROTSR_OEM_PROVD_Pos)               /*!< 0x00000020 */
#define FLASH_ROTSR_OEM_PROVD_6              (0x40UL << FLASH_ROTSR_OEM_PROVD_Pos)               /*!< 0x00000040 */
#define FLASH_ROTSR_OEM_PROVD_7              (0x80UL << FLASH_ROTSR_OEM_PROVD_Pos)               /*!< 0x00000080 */
#define FLASH_ROTSR_DBG_AUTH_Pos             (8U)
#define FLASH_ROTSR_DBG_AUTH_Msk             (0xFFUL << FLASH_ROTSR_DBG_AUTH_Pos)                /*!< 0x0000FF00 */
#define FLASH_ROTSR_DBG_AUTH                 FLASH_ROTSR_DBG_AUTH_Msk                            /*!< Debug authentication method */
#define FLASH_ROTSR_DBG_AUTH_0               (0x1UL << FLASH_ROTSR_DBG_AUTH_Pos)                 /*!< 0x00000100 */
#define FLASH_ROTSR_DBG_AUTH_1               (0x2UL << FLASH_ROTSR_DBG_AUTH_Pos)                 /*!< 0x00000200 */
#define FLASH_ROTSR_DBG_AUTH_2               (0x4UL << FLASH_ROTSR_DBG_AUTH_Pos)                 /*!< 0x00000400 */
#define FLASH_ROTSR_DBG_AUTH_3               (0x8UL << FLASH_ROTSR_DBG_AUTH_Pos)                 /*!< 0x00000800 */
#define FLASH_ROTSR_DBG_AUTH_4               (0x10UL << FLASH_ROTSR_DBG_AUTH_Pos)                /*!< 0x00001000 */
#define FLASH_ROTSR_DBG_AUTH_5               (0x20UL << FLASH_ROTSR_DBG_AUTH_Pos)                /*!< 0x00002000 */
#define FLASH_ROTSR_DBG_AUTH_6               (0x40UL << FLASH_ROTSR_DBG_AUTH_Pos)                /*!< 0x00004000 */
#define FLASH_ROTSR_DBG_AUTH_7               (0x80UL << FLASH_ROTSR_DBG_AUTH_Pos)                /*!< 0x00008000 */
#define FLASH_ROTSR_IROT_SELECT_Pos          (24U)
#define FLASH_ROTSR_IROT_SELECT_Msk          (0xFFUL << FLASH_ROTSR_IROT_SELECT_Pos)             /*!< 0xFF000000 */
#define FLASH_ROTSR_IROT_SELECT              FLASH_ROTSR_IROT_SELECT_Msk                         /*!< iRoT selection */
#define FLASH_ROTSR_IROT_SELECT_0            (0x1UL << FLASH_ROTSR_IROT_SELECT_Pos)              /*!< 0x01000000 */
#define FLASH_ROTSR_IROT_SELECT_1            (0x2UL << FLASH_ROTSR_IROT_SELECT_Pos)              /*!< 0x02000000 */
#define FLASH_ROTSR_IROT_SELECT_2            (0x4UL << FLASH_ROTSR_IROT_SELECT_Pos)              /*!< 0x04000000 */
#define FLASH_ROTSR_IROT_SELECT_3            (0x8UL << FLASH_ROTSR_IROT_SELECT_Pos)              /*!< 0x08000000 */
#define FLASH_ROTSR_IROT_SELECT_4            (0x10UL << FLASH_ROTSR_IROT_SELECT_Pos)             /*!< 0x10000000 */
#define FLASH_ROTSR_IROT_SELECT_5            (0x20UL << FLASH_ROTSR_IROT_SELECT_Pos)             /*!< 0x20000000 */
#define FLASH_ROTSR_IROT_SELECT_6            (0x40UL << FLASH_ROTSR_IROT_SELECT_Pos)             /*!< 0x40000000 */
#define FLASH_ROTSR_IROT_SELECT_7            (0x80UL << FLASH_ROTSR_IROT_SELECT_Pos)             /*!< 0x80000000 */

/****************  Bits definition for FLASH_ROTSRP register  *****************/
#define FLASH_ROTSRP_OEM_PROVD_Pos           (0U)
#define FLASH_ROTSRP_OEM_PROVD_Msk           (0xFFUL << FLASH_ROTSRP_OEM_PROVD_Pos)              /*!< 0x000000FF */
#define FLASH_ROTSRP_OEM_PROVD               FLASH_ROTSRP_OEM_PROVD_Msk                          /*!< OEM provisioned state */
#define FLASH_ROTSRP_OEM_PROVD_0             (0x1UL << FLASH_ROTSRP_OEM_PROVD_Pos)               /*!< 0x00000001 */
#define FLASH_ROTSRP_OEM_PROVD_1             (0x2UL << FLASH_ROTSRP_OEM_PROVD_Pos)               /*!< 0x00000002 */
#define FLASH_ROTSRP_OEM_PROVD_2             (0x4UL << FLASH_ROTSRP_OEM_PROVD_Pos)               /*!< 0x00000004 */
#define FLASH_ROTSRP_OEM_PROVD_3             (0x8UL << FLASH_ROTSRP_OEM_PROVD_Pos)               /*!< 0x00000008 */
#define FLASH_ROTSRP_OEM_PROVD_4             (0x10UL << FLASH_ROTSRP_OEM_PROVD_Pos)              /*!< 0x00000010 */
#define FLASH_ROTSRP_OEM_PROVD_5             (0x20UL << FLASH_ROTSRP_OEM_PROVD_Pos)              /*!< 0x00000020 */
#define FLASH_ROTSRP_OEM_PROVD_6             (0x40UL << FLASH_ROTSRP_OEM_PROVD_Pos)              /*!< 0x00000040 */
#define FLASH_ROTSRP_OEM_PROVD_7             (0x80UL << FLASH_ROTSRP_OEM_PROVD_Pos)              /*!< 0x00000080 */
#define FLASH_ROTSRP_DBG_AUTH_Pos            (8U)
#define FLASH_ROTSRP_DBG_AUTH_Msk            (0xFFUL << FLASH_ROTSRP_DBG_AUTH_Pos)               /*!< 0x0000FF00 */
#define FLASH_ROTSRP_DBG_AUTH                FLASH_ROTSRP_DBG_AUTH_Msk                           /*!< Debug authentication method */
#define FLASH_ROTSRP_DBG_AUTH_0              (0x1UL << FLASH_ROTSRP_DBG_AUTH_Pos)                /*!< 0x00000100 */
#define FLASH_ROTSRP_DBG_AUTH_1              (0x2UL << FLASH_ROTSRP_DBG_AUTH_Pos)                /*!< 0x00000200 */
#define FLASH_ROTSRP_DBG_AUTH_2              (0x4UL << FLASH_ROTSRP_DBG_AUTH_Pos)                /*!< 0x00000400 */
#define FLASH_ROTSRP_DBG_AUTH_3              (0x8UL << FLASH_ROTSRP_DBG_AUTH_Pos)                /*!< 0x00000800 */
#define FLASH_ROTSRP_DBG_AUTH_4              (0x10UL << FLASH_ROTSRP_DBG_AUTH_Pos)               /*!< 0x00001000 */
#define FLASH_ROTSRP_DBG_AUTH_5              (0x20UL << FLASH_ROTSRP_DBG_AUTH_Pos)               /*!< 0x00002000 */
#define FLASH_ROTSRP_DBG_AUTH_6              (0x40UL << FLASH_ROTSRP_DBG_AUTH_Pos)               /*!< 0x00004000 */
#define FLASH_ROTSRP_DBG_AUTH_7              (0x80UL << FLASH_ROTSRP_DBG_AUTH_Pos)               /*!< 0x00008000 */
#define FLASH_ROTSRP_IROT_SELECT_Pos         (24U)
#define FLASH_ROTSRP_IROT_SELECT_Msk         (0xFFUL << FLASH_ROTSRP_IROT_SELECT_Pos)             /*!< 0xFF000000 */
#define FLASH_ROTSRP_IROT_SELECT             FLASH_ROTSRP_IROT_SELECT_Msk                         /*!< iRoT selection */
#define FLASH_ROTSRP_IROT_SELECT_0           (0x1UL << FLASH_ROTSRP_IROT_SELECT_Pos)              /*!< 0x01000000 */
#define FLASH_ROTSRP_IROT_SELECT_1           (0x2UL << FLASH_ROTSRP_IROT_SELECT_Pos)              /*!< 0x02000000 */
#define FLASH_ROTSRP_IROT_SELECT_2           (0x4UL << FLASH_ROTSRP_IROT_SELECT_Pos)              /*!< 0x04000000 */
#define FLASH_ROTSRP_IROT_SELECT_3           (0x8UL << FLASH_ROTSRP_IROT_SELECT_Pos)              /*!< 0x08000000 */
#define FLASH_ROTSRP_IROT_SELECT_4           (0x10UL << FLASH_ROTSRP_IROT_SELECT_Pos)             /*!< 0x10000000 */
#define FLASH_ROTSRP_IROT_SELECT_5           (0x20UL << FLASH_ROTSRP_IROT_SELECT_Pos)             /*!< 0x20000000 */
#define FLASH_ROTSRP_IROT_SELECT_6           (0x40UL << FLASH_ROTSRP_IROT_SELECT_Pos)             /*!< 0x40000000 */
#define FLASH_ROTSRP_IROT_SELECT_7           (0x80UL << FLASH_ROTSRP_IROT_SELECT_Pos)             /*!< 0x80000000 */

