MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S7I8/mcu.h
/********************  Bit definition for JPEG_CONFR4 register  ***************/
#define JPEG_CONFR4_HD_Pos             (0U)
#define JPEG_CONFR4_HD_Msk             (0x1UL << JPEG_CONFR4_HD_Pos)           /*!< 0x00000001 */
#define JPEG_CONFR4_HD                 JPEG_CONFR4_HD_Msk                      /*!<Selects the Huffman table for encoding the DC coefficients */
#define JPEG_CONFR4_HA_Pos             (1U)
#define JPEG_CONFR4_HA_Msk             (0x1UL << JPEG_CONFR4_HA_Pos)           /*!< 0x00000002 */
#define JPEG_CONFR4_HA                 JPEG_CONFR4_HA_Msk                      /*!<Selects the Huffman table for encoding the AC coefficients */
#define JPEG_CONFR4_QT_Pos             (2U)
#define JPEG_CONFR4_QT_Msk             (0x3UL << JPEG_CONFR4_QT_Pos)           /*!< 0x0000000C */
#define JPEG_CONFR4_QT                 JPEG_CONFR4_QT_Msk                      /*!<Selects quantization table associated with a color component */
#define JPEG_CONFR4_QT_0               (0x1UL << JPEG_CONFR4_QT_Pos)           /*!< 0x00000004 */
#define JPEG_CONFR4_QT_1               (0x2UL << JPEG_CONFR4_QT_Pos)           /*!< 0x00000008 */
#define JPEG_CONFR4_NB_Pos             (4U)
#define JPEG_CONFR4_NB_Msk             (0xFUL << JPEG_CONFR4_NB_Pos)           /*!< 0x000000F0 */
#define JPEG_CONFR4_NB                 JPEG_CONFR4_NB_Msk                      /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define JPEG_CONFR4_NB_0               (0x1UL << JPEG_CONFR4_NB_Pos)           /*!< 0x00000010 */
#define JPEG_CONFR4_NB_1               (0x2UL << JPEG_CONFR4_NB_Pos)           /*!< 0x00000020 */
#define JPEG_CONFR4_NB_2               (0x4UL << JPEG_CONFR4_NB_Pos)           /*!< 0x00000040 */
#define JPEG_CONFR4_NB_3               (0x8UL << JPEG_CONFR4_NB_Pos)           /*!< 0x00000080 */
#define JPEG_CONFR4_VSF_Pos            (8U)
#define JPEG_CONFR4_VSF_Msk            (0xFUL << JPEG_CONFR4_VSF_Pos)          /*!< 0x00000F00 */
#define JPEG_CONFR4_VSF                JPEG_CONFR4_VSF_Msk                     /*!<Vertical sampling factor for component 1 */
#define JPEG_CONFR4_VSF_0              (0x1UL << JPEG_CONFR4_VSF_Pos)          /*!< 0x00000100 */
#define JPEG_CONFR4_VSF_1              (0x2UL << JPEG_CONFR4_VSF_Pos)          /*!< 0x00000200 */
#define JPEG_CONFR4_VSF_2              (0x4UL << JPEG_CONFR4_VSF_Pos)          /*!< 0x00000400 */
#define JPEG_CONFR4_VSF_3              (0x8UL << JPEG_CONFR4_VSF_Pos)          /*!< 0x00000800 */
#define JPEG_CONFR4_HSF_Pos            (12U)
#define JPEG_CONFR4_HSF_Msk            (0xFUL << JPEG_CONFR4_HSF_Pos)          /*!< 0x0000F000 */
#define JPEG_CONFR4_HSF                JPEG_CONFR4_HSF_Msk                     /*!<Horizontal sampling factor for component 1 */
#define JPEG_CONFR4_HSF_0              (0x1UL << JPEG_CONFR4_HSF_Pos)          /*!< 0x00001000 */
#define JPEG_CONFR4_HSF_1              (0x2UL << JPEG_CONFR4_HSF_Pos)          /*!< 0x00002000 */
#define JPEG_CONFR4_HSF_2              (0x4UL << JPEG_CONFR4_HSF_Pos)          /*!< 0x00004000 */
#define JPEG_CONFR4_HSF_3              (0x8UL << JPEG_CONFR4_HSF_Pos)          /*!< 0x00008000 */

/********************  Bit definition for JPEG_CONFR5 register  ***************/
#define JPEG_CONFR5_HD_Pos             (0U)
#define JPEG_CONFR5_HD_Msk             (0x1UL << JPEG_CONFR5_HD_Pos)           /*!< 0x00000001 */
#define JPEG_CONFR5_HD                 JPEG_CONFR5_HD_Msk                      /*!<Selects the Huffman table for encoding the DC coefficients */
#define JPEG_CONFR5_HA_Pos             (1U)
#define JPEG_CONFR5_HA_Msk             (0x1UL << JPEG_CONFR5_HA_Pos)           /*!< 0x00000002 */
#define JPEG_CONFR5_HA                 JPEG_CONFR5_HA_Msk                      /*!<Selects the Huffman table for encoding the AC coefficients */
#define JPEG_CONFR5_QT_Pos             (2U)
#define JPEG_CONFR5_QT_Msk             (0x3UL << JPEG_CONFR5_QT_Pos)           /*!< 0x0000000C */
#define JPEG_CONFR5_QT                 JPEG_CONFR5_QT_Msk                      /*!<Selects quantization table associated with a color component */
#define JPEG_CONFR5_QT_0               (0x1UL << JPEG_CONFR5_QT_Pos)           /*!< 0x00000004 */
#define JPEG_CONFR5_QT_1               (0x2UL << JPEG_CONFR5_QT_Pos)           /*!< 0x00000008 */
#define JPEG_CONFR5_NB_Pos             (4U)
#define JPEG_CONFR5_NB_Msk             (0xFUL << JPEG_CONFR5_NB_Pos)           /*!< 0x000000F0 */
#define JPEG_CONFR5_NB                 JPEG_CONFR5_NB_Msk                      /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define JPEG_CONFR5_NB_0               (0x1UL << JPEG_CONFR5_NB_Pos)           /*!< 0x00000010 */
#define JPEG_CONFR5_NB_1               (0x2UL << JPEG_CONFR5_NB_Pos)           /*!< 0x00000020 */
#define JPEG_CONFR5_NB_2               (0x4UL << JPEG_CONFR5_NB_Pos)           /*!< 0x00000040 */
#define JPEG_CONFR5_NB_3               (0x8UL << JPEG_CONFR5_NB_Pos)           /*!< 0x00000080 */
#define JPEG_CONFR5_VSF_Pos            (8U)
#define JPEG_CONFR5_VSF_Msk            (0xFUL << JPEG_CONFR5_VSF_Pos)          /*!< 0x00000F00 */
#define JPEG_CONFR5_VSF                JPEG_CONFR5_VSF_Msk                     /*!<Vertical sampling factor for component 2 */
#define JPEG_CONFR5_VSF_0              (0x1UL << JPEG_CONFR5_VSF_Pos)          /*!< 0x00000100 */
#define JPEG_CONFR5_VSF_1              (0x2UL << JPEG_CONFR5_VSF_Pos)          /*!< 0x00000200 */
#define JPEG_CONFR5_VSF_2              (0x4UL << JPEG_CONFR5_VSF_Pos)          /*!< 0x00000400 */
#define JPEG_CONFR5_VSF_3              (0x8UL << JPEG_CONFR5_VSF_Pos)          /*!< 0x00000800 */
#define JPEG_CONFR5_HSF_Pos            (12U)
#define JPEG_CONFR5_HSF_Msk            (0xFUL << JPEG_CONFR5_HSF_Pos)          /*!< 0x0000F000 */
#define JPEG_CONFR5_HSF                JPEG_CONFR5_HSF_Msk                     /*!<Horizontal sampling factor for component 2 */
#define JPEG_CONFR5_HSF_0              (0x1UL << JPEG_CONFR5_HSF_Pos)          /*!< 0x00001000 */
#define JPEG_CONFR5_HSF_1              (0x2UL << JPEG_CONFR5_HSF_Pos)          /*!< 0x00002000 */
#define JPEG_CONFR5_HSF_2              (0x4UL << JPEG_CONFR5_HSF_Pos)          /*!< 0x00004000 */
#define JPEG_CONFR5_HSF_3              (0x8UL << JPEG_CONFR5_HSF_Pos)          /*!< 0x00008000 */

/********************  Bit definition for JPEG_CONFR6 register  ***************/
#define JPEG_CONFR6_HD_Pos             (0U)
#define JPEG_CONFR6_HD_Msk             (0x1UL << JPEG_CONFR6_HD_Pos)           /*!< 0x00000001 */
#define JPEG_CONFR6_HD                 JPEG_CONFR6_HD_Msk                      /*!<Selects the Huffman table for encoding the DC coefficients */
#define JPEG_CONFR6_HA_Pos             (1U)
#define JPEG_CONFR6_HA_Msk             (0x1UL << JPEG_CONFR6_HA_Pos)           /*!< 0x00000002 */
#define JPEG_CONFR6_HA                 JPEG_CONFR6_HA_Msk                      /*!<Selects the Huffman table for encoding the AC coefficients */
#define JPEG_CONFR6_QT_Pos             (2U)
#define JPEG_CONFR6_QT_Msk             (0x3UL << JPEG_CONFR6_QT_Pos)           /*!< 0x0000000C */
#define JPEG_CONFR6_QT                 JPEG_CONFR6_QT_Msk                      /*!<Selects quantization table associated with a color component */
#define JPEG_CONFR6_QT_0               (0x1UL << JPEG_CONFR6_QT_Pos)           /*!< 0x00000004 */
#define JPEG_CONFR6_QT_1               (0x2UL << JPEG_CONFR6_QT_Pos)           /*!< 0x00000008 */
#define JPEG_CONFR6_NB_Pos             (4U)
#define JPEG_CONFR6_NB_Msk             (0xFUL << JPEG_CONFR6_NB_Pos)           /*!< 0x000000F0 */
#define JPEG_CONFR6_NB                 JPEG_CONFR6_NB_Msk                      /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define JPEG_CONFR6_NB_0               (0x1UL << JPEG_CONFR6_NB_Pos)           /*!< 0x00000010 */
#define JPEG_CONFR6_NB_1               (0x2UL << JPEG_CONFR6_NB_Pos)           /*!< 0x00000020 */
#define JPEG_CONFR6_NB_2               (0x4UL << JPEG_CONFR6_NB_Pos)           /*!< 0x00000040 */
#define JPEG_CONFR6_NB_3               (0x8UL << JPEG_CONFR6_NB_Pos)           /*!< 0x00000080 */
#define JPEG_CONFR6_VSF_Pos            (8U)
#define JPEG_CONFR6_VSF_Msk            (0xFUL << JPEG_CONFR6_VSF_Pos)          /*!< 0x00000F00 */
#define JPEG_CONFR6_VSF                JPEG_CONFR6_VSF_Msk                     /*!<Vertical sampling factor for component 2 */
#define JPEG_CONFR6_VSF_0              (0x1UL << JPEG_CONFR6_VSF_Pos)          /*!< 0x00000100 */
#define JPEG_CONFR6_VSF_1              (0x2UL << JPEG_CONFR6_VSF_Pos)          /*!< 0x00000200 */
#define JPEG_CONFR6_VSF_2              (0x4UL << JPEG_CONFR6_VSF_Pos)          /*!< 0x00000400 */
#define JPEG_CONFR6_VSF_3              (0x8UL << JPEG_CONFR6_VSF_Pos)          /*!< 0x00000800 */
#define JPEG_CONFR6_HSF_Pos            (12U)
#define JPEG_CONFR6_HSF_Msk            (0xFUL << JPEG_CONFR6_HSF_Pos)          /*!< 0x0000F000 */
#define JPEG_CONFR6_HSF                JPEG_CONFR6_HSF_Msk                     /*!<Horizontal sampling factor for component 2 */
#define JPEG_CONFR6_HSF_0              (0x1UL << JPEG_CONFR6_HSF_Pos)          /*!< 0x00001000 */
#define JPEG_CONFR6_HSF_1              (0x2UL << JPEG_CONFR6_HSF_Pos)          /*!< 0x00002000 */
#define JPEG_CONFR6_HSF_2              (0x4UL << JPEG_CONFR6_HSF_Pos)          /*!< 0x00004000 */
#define JPEG_CONFR6_HSF_3              (0x8UL << JPEG_CONFR6_HSF_Pos)          /*!< 0x00008000 */

/********************  Bit definition for JPEG_CONFR7 register  ***************/
#define JPEG_CONFR7_HD_Pos             (0U)
#define JPEG_CONFR7_HD_Msk             (0x1UL << JPEG_CONFR7_HD_Pos)           /*!< 0x00000001 */
#define JPEG_CONFR7_HD                 JPEG_CONFR7_HD_Msk                      /*!<Selects the Huffman table for encoding the DC coefficients */
#define JPEG_CONFR7_HA_Pos             (1U)
#define JPEG_CONFR7_HA_Msk             (0x1UL << JPEG_CONFR7_HA_Pos)           /*!< 0x00000002 */
#define JPEG_CONFR7_HA                 JPEG_CONFR7_HA_Msk                      /*!<Selects the Huffman table for encoding the AC coefficients */
#define JPEG_CONFR7_QT_Pos             (2U)
#define JPEG_CONFR7_QT_Msk             (0x3UL << JPEG_CONFR7_QT_Pos)           /*!< 0x0000000C */
#define JPEG_CONFR7_QT                 JPEG_CONFR7_QT_Msk                      /*!<Selects quantization table associated with a color component */
#define JPEG_CONFR7_QT_0               (0x1UL << JPEG_CONFR7_QT_Pos)           /*!< 0x00000004 */
#define JPEG_CONFR7_QT_1               (0x2UL << JPEG_CONFR7_QT_Pos)           /*!< 0x00000008 */
#define JPEG_CONFR7_NB_Pos             (4U)
#define JPEG_CONFR7_NB_Msk             (0xFUL << JPEG_CONFR7_NB_Pos)           /*!< 0x000000F0 */
#define JPEG_CONFR7_NB                 JPEG_CONFR7_NB_Msk                      /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define JPEG_CONFR7_NB_0               (0x1UL << JPEG_CONFR7_NB_Pos)           /*!< 0x00000010 */
#define JPEG_CONFR7_NB_1               (0x2UL << JPEG_CONFR7_NB_Pos)           /*!< 0x00000020 */
#define JPEG_CONFR7_NB_2               (0x4UL << JPEG_CONFR7_NB_Pos)           /*!< 0x00000040 */
#define JPEG_CONFR7_NB_3               (0x8UL << JPEG_CONFR7_NB_Pos)           /*!< 0x00000080 */
#define JPEG_CONFR7_VSF_Pos            (8U)
#define JPEG_CONFR7_VSF_Msk            (0xFUL << JPEG_CONFR7_VSF_Pos)          /*!< 0x00000F00 */
#define JPEG_CONFR7_VSF                JPEG_CONFR7_VSF_Msk                     /*!<Vertical sampling factor for component 2 */
#define JPEG_CONFR7_VSF_0              (0x1UL << JPEG_CONFR7_VSF_Pos)          /*!< 0x00000100 */
#define JPEG_CONFR7_VSF_1              (0x2UL << JPEG_CONFR7_VSF_Pos)          /*!< 0x00000200 */
#define JPEG_CONFR7_VSF_2              (0x4UL << JPEG_CONFR7_VSF_Pos)          /*!< 0x00000400 */
#define JPEG_CONFR7_VSF_3              (0x8UL << JPEG_CONFR7_VSF_Pos)          /*!< 0x00000800 */
#define JPEG_CONFR7_HSF_Pos            (12U)
#define JPEG_CONFR7_HSF_Msk            (0xFUL << JPEG_CONFR7_HSF_Pos)          /*!< 0x0000F000 */
#define JPEG_CONFR7_HSF                JPEG_CONFR7_HSF_Msk                     /*!<Horizontal sampling factor for component 2 */
#define JPEG_CONFR7_HSF_0              (0x1UL << JPEG_CONFR7_HSF_Pos)          /*!< 0x00001000 */
#define JPEG_CONFR7_HSF_1              (0x2UL << JPEG_CONFR7_HSF_Pos)          /*!< 0x00002000 */
#define JPEG_CONFR7_HSF_2              (0x4UL << JPEG_CONFR7_HSF_Pos)          /*!< 0x00004000 */
#define JPEG_CONFR7_HSF_3              (0x8UL << JPEG_CONFR7_HSF_Pos)          /*!< 0x00008000 */

/********************  Bit definition for JPEG_CR register  *******************/
#define JPEG_CR_JCEN_Pos               (0U)
#define JPEG_CR_JCEN_Msk               (0x1UL << JPEG_CR_JCEN_Pos)             /*!< 0x00000001 */
#define JPEG_CR_JCEN                   JPEG_CR_JCEN_Msk                        /*!<Enable the JPEG Codec Core */
#define JPEG_CR_IFTIE_Pos              (1U)
#define JPEG_CR_IFTIE_Msk              (0x1UL << JPEG_CR_IFTIE_Pos)            /*!< 0x00000002 */
#define JPEG_CR_IFTIE                  JPEG_CR_IFTIE_Msk                       /*!<Input FIFO Threshold Interrupt Enable */
#define JPEG_CR_IFNFIE_Pos             (2U)
#define JPEG_CR_IFNFIE_Msk             (0x1UL << JPEG_CR_IFNFIE_Pos)           /*!< 0x00000004 */
#define JPEG_CR_IFNFIE                 JPEG_CR_IFNFIE_Msk                      /*!<Input FIFO Not Full Interrupt Enable */
#define JPEG_CR_OFTIE_Pos              (3U)
#define JPEG_CR_OFTIE_Msk              (0x1UL << JPEG_CR_OFTIE_Pos)            /*!< 0x00000008 */
#define JPEG_CR_OFTIE                  JPEG_CR_OFTIE_Msk                       /*!<Output FIFO Threshold Interrupt Enable */
#define JPEG_CR_OFNEIE_Pos             (4U)
#define JPEG_CR_OFNEIE_Msk             (0x1UL << JPEG_CR_OFNEIE_Pos)           /*!< 0x00000010 */
#define JPEG_CR_OFNEIE                 JPEG_CR_OFNEIE_Msk                      /*!<Output FIFO Not Empty Interrupt Enable */
#define JPEG_CR_EOCIE_Pos              (5U)
#define JPEG_CR_EOCIE_Msk              (0x1UL << JPEG_CR_EOCIE_Pos)            /*!< 0x00000020 */
#define JPEG_CR_EOCIE                  JPEG_CR_EOCIE_Msk                       /*!<End of Conversion Interrupt Enable */
#define JPEG_CR_HPDIE_Pos              (6U)
#define JPEG_CR_HPDIE_Msk              (0x1UL << JPEG_CR_HPDIE_Pos)            /*!< 0x00000040 */
#define JPEG_CR_HPDIE                  JPEG_CR_HPDIE_Msk                       /*!<Header Parsing Done Interrupt Enable */
#define JPEG_CR_IDMAEN_Pos             (11U)
#define JPEG_CR_IDMAEN_Msk             (0x1UL << JPEG_CR_IDMAEN_Pos)           /*!< 0x00000800 */
#define JPEG_CR_IDMAEN                 JPEG_CR_IDMAEN_Msk                      /*!< Input DMA enable */
#define JPEG_CR_ODMAEN_Pos             (12U)
#define JPEG_CR_ODMAEN_Msk             (0x1UL << JPEG_CR_ODMAEN_Pos)           /*!< 0x00001000 */
#define JPEG_CR_ODMAEN                 JPEG_CR_ODMAEN_Msk                      /*!< output DMA enable */
#define JPEG_CR_IFF_Pos                (13U)
#define JPEG_CR_IFF_Msk                (0x1UL << JPEG_CR_IFF_Pos)              /*!< 0x00002000 */
#define JPEG_CR_IFF                    JPEG_CR_IFF_Msk                         /*!<Flush the input FIFO */
#define JPEG_CR_OFF_Pos                (14U)
#define JPEG_CR_OFF_Msk                (0x1UL << JPEG_CR_OFF_Pos)              /*!< 0x00004000 */
#define JPEG_CR_OFF                    JPEG_CR_OFF_Msk                         /*!<Flush the output FIFO */

/********************  Bit definition for JPEG_SR register  *******************/
#define JPEG_SR_IFTF_Pos               (1U)
#define JPEG_SR_IFTF_Msk               (0x1UL << JPEG_SR_IFTF_Pos)             /*!< 0x00000002 */
#define JPEG_SR_IFTF                   JPEG_SR_IFTF_Msk                        /*!<Input FIFO is not full and is below its threshold flag */
#define JPEG_SR_IFNFF_Pos              (2U)
#define JPEG_SR_IFNFF_Msk              (0x1UL << JPEG_SR_IFNFF_Pos)            /*!< 0x00000004 */
#define JPEG_SR_IFNFF                  JPEG_SR_IFNFF_Msk                       /*!<Input FIFO Not Full Flag, a data can be written */
#define JPEG_SR_OFTF_Pos               (3U)
#define JPEG_SR_OFTF_Msk               (0x1UL << JPEG_SR_OFTF_Pos)             /*!< 0x00000008 */
#define JPEG_SR_OFTF                   JPEG_SR_OFTF_Msk                        /*!<Output FIFO is not empty and has reach its threshold */
#define JPEG_SR_OFNEF_Pos              (4U)
#define JPEG_SR_OFNEF_Msk              (0x1UL << JPEG_SR_OFNEF_Pos)            /*!< 0x00000010 */
#define JPEG_SR_OFNEF                  JPEG_SR_OFNEF_Msk                       /*!<Output FIFO is not empty, a data is available */
#define JPEG_SR_EOCF_Pos               (5U)
#define JPEG_SR_EOCF_Msk               (0x1UL << JPEG_SR_EOCF_Pos)             /*!< 0x00000020 */
#define JPEG_SR_EOCF                   JPEG_SR_EOCF_Msk                        /*!<JPEG Codec core has finished the encoding or the decoding process and than last data has been sent to the output FIFO */
#define JPEG_SR_HPDF_Pos               (6U)
#define JPEG_SR_HPDF_Msk               (0x1UL << JPEG_SR_HPDF_Pos)             /*!< 0x00000040 */
#define JPEG_SR_HPDF                   JPEG_SR_HPDF_Msk                        /*!<JPEG Codec has finished the parsing of the headers and the internal registers have been updated */
#define JPEG_SR_COF_Pos                (7U)
#define JPEG_SR_COF_Msk                (0x1UL << JPEG_SR_COF_Pos)              /*!< 0x00000080 */
#define JPEG_SR_COF                    JPEG_SR_COF_Msk                         /*!<JPEG Codec operation on going flag */

