MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32H7S7I8/mcu.h
#define RCC_PLL2DIVR2_DIVT_Pos        (8U)
#define RCC_PLL2DIVR2_DIVT_Msk        (0x7UL << RCC_PLL2DIVR2_DIVT_Pos)      /*!< 0x00000700 */
#define RCC_PLL2DIVR2_DIVT            RCC_PLL2DIVR2_DIVT_Msk                 /*!< DIVT2[2:0] bits: PLL2 DIVT division factor */
#define RCC_PLL2DIVR2_DIVT_0          (0x1UL << RCC_PLL2DIVR2_DIVT_Pos)      /*!< 0x00000100 */
#define RCC_PLL2DIVR2_DIVT_1          (0x2UL << RCC_PLL2DIVR2_DIVT_Pos)      /*!< 0x00000200 */
#define RCC_PLL2DIVR2_DIVT_2          (0x4UL << RCC_PLL2DIVR2_DIVT_Pos)      /*!< 0x00000400 */

/********************  Bit definition for RCC_PLL3DIVR2 register  *************/
#define RCC_PLL3DIVR2_DIVS_Pos        (0U)
#define RCC_PLL3DIVR2_DIVS_Msk        (0x7UL << RCC_PLL3DIVR2_DIVS_Pos)      /*!< 0x00000007 */
#define RCC_PLL3DIVR2_DIVS            RCC_PLL3DIVR2_DIVS_Msk                 /*!< DIVS3[2:0] bits: PLL3 DIVS division factor */
#define RCC_PLL3DIVR2_DIVS_0          (0x1UL << RCC_PLL3DIVR2_DIVS_Pos)      /*!< 0x00000001 */
#define RCC_PLL3DIVR2_DIVS_1          (0x2UL << RCC_PLL3DIVR2_DIVS_Pos)      /*!< 0x00000002 */
#define RCC_PLL3DIVR2_DIVS_2          (0x4UL << RCC_PLL3DIVR2_DIVS_Pos)      /*!< 0x00000004 */

/********************  Bit definition for RCC_PLL1SSCGR register  *************/
#define RCC_PLL1SSCGR_MODPER_Pos      (0U)
#define RCC_PLL1SSCGR_MODPER_Msk      (0x1FFFUL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00001FFF */
#define RCC_PLL1SSCGR_MODPER          RCC_PLL1SSCGR_MODPER_Msk                /*!< MODPER[12:0] bits: Modulation Period Adjustment */
#define RCC_PLL1SSCGR_MODPER_0        (0x0001UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000001 */
#define RCC_PLL1SSCGR_MODPER_1        (0x0002UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000002 */
#define RCC_PLL1SSCGR_MODPER_2        (0x0004UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000004 */
#define RCC_PLL1SSCGR_MODPER_3        (0x0008UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000008 */
#define RCC_PLL1SSCGR_MODPER_4        (0x0010UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000010 */
#define RCC_PLL1SSCGR_MODPER_5        (0x0020UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000020 */
#define RCC_PLL1SSCGR_MODPER_6        (0x0040UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000040 */
#define RCC_PLL1SSCGR_MODPER_7        (0x0080UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000080 */
#define RCC_PLL1SSCGR_MODPER_8        (0x0100UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000100 */
#define RCC_PLL1SSCGR_MODPER_9        (0x0200UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000200 */
#define RCC_PLL1SSCGR_MODPER_10       (0x0400UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000400 */
#define RCC_PLL1SSCGR_MODPER_11       (0x0800UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00000800 */
#define RCC_PLL1SSCGR_MODPER_12       (0x1000UL << RCC_PLL1SSCGR_MODPER_Pos)  /*!< 0x00001000 */
#define RCC_PLL1SSCGR_TPDFNDIS_Pos    (13U)
#define RCC_PLL1SSCGR_TPDFNDIS_Msk    (0x1UL << RCC_PLL1SSCGR_TPDFNDIS_Pos)   /*!< 0x00002000 */
#define RCC_PLL1SSCGR_TPDFNDIS        RCC_PLL1SSCGR_TPDFNDIS_Msk
#define RCC_PLL1SSCGR_RPDFNDIS_Pos    (14U)
#define RCC_PLL1SSCGR_RPDFNDIS_Msk    (0x1UL << RCC_PLL1SSCGR_RPDFNDIS_Pos)   /*!< 0x00004000 */
#define RCC_PLL1SSCGR_RPDFNDIS        RCC_PLL1SSCGR_RPDFNDIS_Msk
#define RCC_PLL1SSCGR_SPREADSEL_Pos   (15U)
#define RCC_PLL1SSCGR_SPREADSEL_Msk   (0x1UL << RCC_PLL1SSCGR_SPREADSEL_Pos)  /*!< 0x00008000 */
#define RCC_PLL1SSCGR_SPREADSEL       RCC_PLL1SSCGR_SPREADSEL_Msk
#define RCC_PLL1SSCGR_INCSTEP_Pos     (16U)
#define RCC_PLL1SSCGR_INCSTEP_Msk     (0x7FFFUL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x7FFF0000 */
#define RCC_PLL1SSCGR_INCSTEP         RCC_PLL1SSCGR_INCSTEP_Msk               /*!< INCSTEP[14:0] bits: Modulation Depth Adjustment */
#define RCC_PLL1SSCGR_INCSTEP_0       (0x0001UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00010000 */
#define RCC_PLL1SSCGR_INCSTEP_1       (0x0002UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00020000 */
#define RCC_PLL1SSCGR_INCSTEP_2       (0x0004UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00040000 */
#define RCC_PLL1SSCGR_INCSTEP_3       (0x0008UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00080000 */
#define RCC_PLL1SSCGR_INCSTEP_4       (0x0010UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00100000 */
#define RCC_PLL1SSCGR_INCSTEP_5       (0x0020UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00200000 */
#define RCC_PLL1SSCGR_INCSTEP_6       (0x0040UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00400000 */
#define RCC_PLL1SSCGR_INCSTEP_7       (0x0080UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x00800000 */
#define RCC_PLL1SSCGR_INCSTEP_8       (0x0100UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x01000000 */
#define RCC_PLL1SSCGR_INCSTEP_9       (0x0200UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x02000000 */
#define RCC_PLL1SSCGR_INCSTEP_10      (0x0400UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x04000000 */
#define RCC_PLL1SSCGR_INCSTEP_11      (0x0800UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x08000000 */
#define RCC_PLL1SSCGR_INCSTEP_12      (0x1000UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x10000000 */
#define RCC_PLL1SSCGR_INCSTEP_13      (0x2000UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x20000000 */
#define RCC_PLL1SSCGR_INCSTEP_14      (0x4000UL << RCC_PLL1SSCGR_INCSTEP_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_PLL2SSCGR register  *************/
#define RCC_PLL2SSCGR_MODPER_Pos      (0U)
#define RCC_PLL2SSCGR_MODPER_Msk      (0x1FFFUL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00001FFF */
#define RCC_PLL2SSCGR_MODPER          RCC_PLL2SSCGR_MODPER_Msk                /*!< MODPER[12:0] bits: Modulation Period Adjustment */
#define RCC_PLL2SSCGR_MODPER_0        (0x0001UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000001 */
#define RCC_PLL2SSCGR_MODPER_1        (0x0002UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000002 */
#define RCC_PLL2SSCGR_MODPER_2        (0x0004UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000004 */
#define RCC_PLL2SSCGR_MODPER_3        (0x0008UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000008 */
#define RCC_PLL2SSCGR_MODPER_4        (0x0010UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000010 */
#define RCC_PLL2SSCGR_MODPER_5        (0x0020UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000020 */
#define RCC_PLL2SSCGR_MODPER_6        (0x0040UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000040 */
#define RCC_PLL2SSCGR_MODPER_7        (0x0080UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000080 */
#define RCC_PLL2SSCGR_MODPER_8        (0x0100UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000100 */
#define RCC_PLL2SSCGR_MODPER_9        (0x0200UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000200 */
#define RCC_PLL2SSCGR_MODPER_10       (0x0400UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000400 */
#define RCC_PLL2SSCGR_MODPER_11       (0x0800UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00000800 */
#define RCC_PLL2SSCGR_MODPER_12       (0x1000UL << RCC_PLL2SSCGR_MODPER_Pos)  /*!< 0x00001000 */
#define RCC_PLL2SSCGR_TPDFNDIS_Pos    (13U)
#define RCC_PLL2SSCGR_TPDFNDIS_Msk    (0x1UL << RCC_PLL2SSCGR_TPDFNDIS_Pos)   /*!< 0x00002000 */
#define RCC_PLL2SSCGR_TPDFNDIS        RCC_PLL2SSCGR_TPDFNDIS_Msk
#define RCC_PLL2SSCGR_RPDFNDIS_Pos    (14U)
#define RCC_PLL2SSCGR_RPDFNDIS_Msk    (0x1UL << RCC_PLL2SSCGR_RPDFNDIS_Pos)   /*!< 0x00004000 */
#define RCC_PLL2SSCGR_RPDFNDIS        RCC_PLL2SSCGR_RPDFNDIS_Msk
#define RCC_PLL2SSCGR_SPREADSEL_Pos   (15U)
#define RCC_PLL2SSCGR_SPREADSEL_Msk   (0x1UL << RCC_PLL2SSCGR_SPREADSEL_Pos)  /*!< 0x00008000 */
#define RCC_PLL2SSCGR_SPREADSEL       RCC_PLL2SSCGR_SPREADSEL_Msk
#define RCC_PLL2SSCGR_INCSTEP_Pos     (16U)
#define RCC_PLL2SSCGR_INCSTEP_Msk     (0x7FFFUL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x7FFF0000 */
#define RCC_PLL2SSCGR_INCSTEP         RCC_PLL2SSCGR_INCSTEP_Msk               /*!< INCSTEP[14:0] bits: Modulation Depth Adjustment */
#define RCC_PLL2SSCGR_INCSTEP_0       (0x0001UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00010000 */
#define RCC_PLL2SSCGR_INCSTEP_1       (0x0002UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00020000 */
#define RCC_PLL2SSCGR_INCSTEP_2       (0x0004UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00040000 */
#define RCC_PLL2SSCGR_INCSTEP_3       (0x0008UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00080000 */
#define RCC_PLL2SSCGR_INCSTEP_4       (0x0010UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00100000 */
#define RCC_PLL2SSCGR_INCSTEP_5       (0x0020UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00200000 */
#define RCC_PLL2SSCGR_INCSTEP_6       (0x0040UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00400000 */
#define RCC_PLL2SSCGR_INCSTEP_7       (0x0080UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x00800000 */
#define RCC_PLL2SSCGR_INCSTEP_8       (0x0100UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x01000000 */
#define RCC_PLL2SSCGR_INCSTEP_9       (0x0200UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x02000000 */
#define RCC_PLL2SSCGR_INCSTEP_10      (0x0400UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x04000000 */
#define RCC_PLL2SSCGR_INCSTEP_11      (0x0800UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x08000000 */
#define RCC_PLL2SSCGR_INCSTEP_12      (0x1000UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x10000000 */
#define RCC_PLL2SSCGR_INCSTEP_13      (0x2000UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x20000000 */
#define RCC_PLL2SSCGR_INCSTEP_14      (0x4000UL << RCC_PLL2SSCGR_INCSTEP_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_PLL3SSCGR register  *************/
#define RCC_PLL3SSCGR_MODPER_Pos      (0U)
#define RCC_PLL3SSCGR_MODPER_Msk      (0x1FFFUL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00001FFF */
#define RCC_PLL3SSCGR_MODPER          RCC_PLL3SSCGR_MODPER_Msk                /*!< MODPER[12:0] bits: Modulation Period Adjustment */
#define RCC_PLL3SSCGR_MODPER_0        (0x0001UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000001 */
#define RCC_PLL3SSCGR_MODPER_1        (0x0002UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000002 */
#define RCC_PLL3SSCGR_MODPER_2        (0x0004UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000004 */
#define RCC_PLL3SSCGR_MODPER_3        (0x0008UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000008 */
#define RCC_PLL3SSCGR_MODPER_4        (0x0010UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000010 */
#define RCC_PLL3SSCGR_MODPER_5        (0x0020UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000020 */
#define RCC_PLL3SSCGR_MODPER_6        (0x0040UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000040 */
#define RCC_PLL3SSCGR_MODPER_7        (0x0080UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000080 */
#define RCC_PLL3SSCGR_MODPER_8        (0x0100UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000100 */
#define RCC_PLL3SSCGR_MODPER_9        (0x0200UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000200 */
#define RCC_PLL3SSCGR_MODPER_10       (0x0400UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000400 */
#define RCC_PLL3SSCGR_MODPER_11       (0x0800UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00000800 */
#define RCC_PLL3SSCGR_MODPER_12       (0x1000UL << RCC_PLL3SSCGR_MODPER_Pos)  /*!< 0x00001000 */
#define RCC_PLL3SSCGR_TPDFNDIS_Pos    (13U)
#define RCC_PLL3SSCGR_TPDFNDIS_Msk    (0x1UL << RCC_PLL3SSCGR_TPDFNDIS_Pos)   /*!< 0x00002000 */
#define RCC_PLL3SSCGR_TPDFNDIS        RCC_PLL3SSCGR_TPDFNDIS_Msk
#define RCC_PLL3SSCGR_RPDFNDIS_Pos    (14U)
#define RCC_PLL3SSCGR_RPDFNDIS_Msk    (0x1UL << RCC_PLL3SSCGR_RPDFNDIS_Pos)   /*!< 0x00004000 */
#define RCC_PLL3SSCGR_RPDFNDIS        RCC_PLL3SSCGR_RPDFNDIS_Msk
#define RCC_PLL3SSCGR_SPREADSEL_Pos   (15U)
#define RCC_PLL3SSCGR_SPREADSEL_Msk   (0x1UL << RCC_PLL3SSCGR_SPREADSEL_Pos)  /*!< 0x00008000 */
#define RCC_PLL3SSCGR_SPREADSEL       RCC_PLL3SSCGR_SPREADSEL_Msk
#define RCC_PLL3SSCGR_INCSTEP_Pos     (16U)
#define RCC_PLL3SSCGR_INCSTEP_Msk     (0x7FFFUL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x7FFF0000 */
#define RCC_PLL3SSCGR_INCSTEP         RCC_PLL3SSCGR_INCSTEP_Msk               /*!< INCSTEP[14:0] bits: Modulation Depth Adjustment */
#define RCC_PLL3SSCGR_INCSTEP_0       (0x0001UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00010000 */
#define RCC_PLL3SSCGR_INCSTEP_1       (0x0002UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00020000 */
#define RCC_PLL3SSCGR_INCSTEP_2       (0x0004UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00040000 */
#define RCC_PLL3SSCGR_INCSTEP_3       (0x0008UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00080000 */
#define RCC_PLL3SSCGR_INCSTEP_4       (0x0010UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00100000 */
#define RCC_PLL3SSCGR_INCSTEP_5       (0x0020UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00200000 */
#define RCC_PLL3SSCGR_INCSTEP_6       (0x0040UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00400000 */
#define RCC_PLL3SSCGR_INCSTEP_7       (0x0080UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x00800000 */
#define RCC_PLL3SSCGR_INCSTEP_8       (0x0100UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x01000000 */
#define RCC_PLL3SSCGR_INCSTEP_9       (0x0200UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x02000000 */
#define RCC_PLL3SSCGR_INCSTEP_10      (0x0400UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x04000000 */
#define RCC_PLL3SSCGR_INCSTEP_11      (0x0800UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x08000000 */
#define RCC_PLL3SSCGR_INCSTEP_12      (0x1000UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x10000000 */
#define RCC_PLL3SSCGR_INCSTEP_13      (0x2000UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x20000000 */
#define RCC_PLL3SSCGR_INCSTEP_14      (0x4000UL << RCC_PLL3SSCGR_INCSTEP_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_CKPROTR register  ***************/
#define RCC_CKPROTR_XSPICKP_Pos        (0U)
#define RCC_CKPROTR_XSPICKP_Msk        (0x1UL << RCC_CKPROTR_XSPICKP_Pos)      /*!< 0x00000001 */
#define RCC_CKPROTR_XSPICKP            RCC_CKPROTR_XSPICKP_Msk
#define RCC_CKPROTR_FMCCKP_Pos         (1U)
#define RCC_CKPROTR_FMCCKP_Msk         (0x1UL << RCC_CKPROTR_FMCCKP_Pos)       /*!< 0x00000002 */
#define RCC_CKPROTR_FMCCKP             RCC_CKPROTR_FMCCKP_Msk
#define RCC_CKPROTR_XSPI1SWP_Pos       (4U)
#define RCC_CKPROTR_XSPI1SWP_Msk       (0x7UL << RCC_CKPROTR_XSPI1SWP_Pos)     /*!< 0x00000070 */
#define RCC_CKPROTR_XSPI1SWP           RCC_CKPROTR_XSPI1SWP_Msk
#define RCC_CKPROTR_XSPI1SWP_0         (0x1UL << RCC_CKPROTR_XSPI1SWP_Pos)     /*!< 0x00000010 */
#define RCC_CKPROTR_XSPI1SWP_1         (0x2UL << RCC_CKPROTR_XSPI1SWP_Pos)     /*!< 0x00000020 */
#define RCC_CKPROTR_XSPI1SWP_2         (0x4UL << RCC_CKPROTR_XSPI1SWP_Pos)     /*!< 0x00000040 */
#define RCC_CKPROTR_XSPI2SWP_Pos       (8U)
#define RCC_CKPROTR_XSPI2SWP_Msk       (0x7UL << RCC_CKPROTR_XSPI2SWP_Pos)     /*!< 0x00000700 */
#define RCC_CKPROTR_XSPI2SWP           RCC_CKPROTR_XSPI2SWP_Msk
#define RCC_CKPROTR_XSPI2SWP_0         (0x1UL << RCC_CKPROTR_XSPI2SWP_Pos)     /*!< 0x00000100 */
#define RCC_CKPROTR_XSPI2SWP_1         (0x2UL << RCC_CKPROTR_XSPI2SWP_Pos)     /*!< 0x00000200 */
#define RCC_CKPROTR_XSPI2SWP_2         (0x4UL << RCC_CKPROTR_XSPI2SWP_Pos)     /*!< 0x00000400 */
#define RCC_CKPROTR_FMCSWP_Pos         (12U)
#define RCC_CKPROTR_FMCSWP_Msk         (0x7UL << RCC_CKPROTR_FMCSWP_Pos)       /*!< 0x00007000 */
#define RCC_CKPROTR_FMCSWP             RCC_CKPROTR_FMCSWP_Msk
#define RCC_CKPROTR_FMCSWP_0           (0x1UL << RCC_CKPROTR_FMCSWP_Pos)       /*!< 0x00001000 */
#define RCC_CKPROTR_FMCSWP_1           (0x2UL << RCC_CKPROTR_FMCSWP_Pos)       /*!< 0x00002000 */
#define RCC_CKPROTR_FMCSWP_2           (0x4UL << RCC_CKPROTR_FMCSWP_Pos)       /*!< 0x00004000 */

